Documents/ЗаказНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаказНаСклад</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПозицииЛекарств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Лекарство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНаЛекарства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНаЛекарства</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лекарство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаказНаСклад/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПозицииЛекарствЛекарствоПриИзменении(Элемент)
	
	ТекущиеДанныеСтрока = Элементы.ПозицииЛекарств.ТекущиеДанные;
	
	цена =ВернутьЦенуЛекарства(ТекущиеДанныеСтрока.Лекарство, Объект.Дата); 
	ТекущиеДанныеСтрока.Цена = цена;
КонецПроцедуры    



&НаСервере
функция ВернутьЦенуЛекарства(Лекарство, Дата)
         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНаЛекарстваСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНаЛекарства.СрезПоследних(&Дата, Лекарство = &Лекарство) КАК ЦеныНаЛекарстваСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Лекарство", Лекарство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		цена = ВыборкаДетальныеЗаписи.Цена;	
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Возврат цена;
КонецФункции

&НаКлиенте
Процедура ПозицииЛекарствКоличествоПриИзменении(Элемент)
	ТекущиеДанныеСтрока = Элементы.ПозицииЛекарств.ТекущиеДанные;
	
    ТекущиеДанныеСтрока.Сумма = ТекущиеДанныеСтрока.Цена * ТекущиеДанныеСтрока.Количество;
КонецПроцедуры
